app/controllers/products_controller.rb

INSERT INTO "products" ("name", "price", "img", "in_stock", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Sheet Mask"], ["price", 12], ["img", "https://i.imgur.com/Cmo8Wfu.jpg"], ["in_stock", true], ["created_at", "2020-03-06 18:15:50.577655"], ["updated_at", "2020-03-06 18:15:50.577655"]]
---
  def create
    @product = Product.new(product_params)

    if @product.save

UPDATE "products" SET "price" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["price", 14], ["updated_at", "2020-03-06 18:16:09.482229"], ["id", 9]]
---
  def update
    if @product.update(product_params)