app/controllers/users_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def cartadd
    puts params
    @product = Product.find(params[:product_id])

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def cartremove
    @product = Product.find(params[:product_id])